{
  "crystal_sensing_manual": {
    "name": "Руководство по кристальному чутью",
    "description": "Учебное пособие для начинающих Искателей, написанное профессором Каландрией. Содержит основы работы с осколками Великого Кристалла и упражнения для развития врождённого дара.",
    "type": "book",
    "subtype": "skill_book",
    "rarity": "uncommon",
    "value": 50,
    "weight": 0.7,
    "stackable": false,
    "properties": {
      "skill_boost": "crystal_sensing",
      "knowledge_level": "beginner",
      "skill_exp": 50,
      "pages": 124
    },
    "contents": [
      {
        "chapter": "Введение",
        "text": "Дар Искателя — редкая и ценная способность в мире, где осколки Великого Кристалла играют такую важную роль. Если вы читаете эту книгу, значит, в вас обнаружена искра этого дара, и теперь ваша задача — развить её в полноценное умение."
      },
      {
        "chapter": "Основы восприятия",
        "text": "Первый шаг Искателя — научиться чувствовать присутствие осколков. Закройте глаза, очистите разум и представьте, что вокруг вас распространяются невидимые волны. Осколки создают характерные 'пульсации' в этих волнах, которые вы можете научиться распознавать."
      },
      {
        "chapter": "Типы осколков",
        "text": "Существует пять основных типов осколков, каждый со своими характерными 'отпечатками': Осколки Созидания (тёплые, пульсирующие), Осколки Разрушения (холодные, резкие), Осколки Стихий (изменчивые, текучие), Осколки Разума (глубокие, резонирующие) и Осколки Искажения (нестабильные, мерцающие)."
      },
      {
        "chapter": "Практические упражнения",
        "text": "Упражнение 1: Поместите несколько кристальных фрагментов разных типов в непрозрачные контейнеры. Попробуйте определить тип осколка, не открывая контейнер.\nУпражнение 2: Закройте глаза и попросите помощника разместить осколок в комнате. Попытайтесь указать его местоположение.\nУпражнение 3: Держите в руках осколок и попытайтесь направить через него небольшой поток своей энергии."
      },
      {
        "chapter": "Стабилизация",
        "text": "Нестабильные осколки могут быть опасны. Искатель должен уметь успокаивать энергетические колебания внутри осколка. Представьте, что ваше сознание обволакивает осколок подобно мягкому одеялу, гася хаотичные всплески энергии и приводя их к гармоничному резонансу с вашей собственной энергией."
      },
      {
        "chapter": "Продвинутые техники",
        "text": "По мере развития навыка вы сможете не только чувствовать осколки, но и влиять на них, усиливать или подавлять их свойства, комбинировать разные типы для создания сложных эффектов. Но помните: сила Искателя требует ответственности. Никогда не пытайтесь контролировать больше осколков, чем можете стабилизировать."
      },
      {
        "chapter": "Заключение",
        "text": "Путь Искателя — это постоянное развитие и обучение. Даже самые опытные мастера продолжают открывать новые свойства осколков. Будьте терпеливы, практикуйтесь ежедневно, и со временем вы научитесь чувствовать тончайшие нюансы кристальной энергии."
      }
    ],
    "effects": {
      "on_read": [
        {
          "type": "add_skill_exp",
          "skill_id": "crystal_sensing",
          "amount": 50
        },
        {
          "type": "add_knowledge",
          "knowledge_id": "crystal_lore",
          "level": 1
        }
      ]
    }
  }
}
