{
  "lab_assistant_mirren": {
    "name": "Миррен",
    "title": "Ассистент лаборатории",
    "description": "Молодой человек с пытливыми глазами и короткими светлыми волосами. Одет в синюю мантию с серебряной отделкой — форму младших исследователей Академии. На его руках тонкие перчатки для работы с кристаллами. Кажется немного рассеянным, но очень увлечённым своей работой.",
    "type": "quest",
    "dialogue_tree": {
      "greeting": {
        "text": "Здравствуйте! Добро пожаловать в лабораторию кристаллов. Я Миррен, ассистент профессора Каландрии. Чем могу помочь?",
        "options": [
          {
            "text": "Расскажи о лаборатории",
            "next": "about_lab"
          },
          {
            "text": "Что вы здесь изучаете?",
            "next": "about_research"
          },
          {
            "text": "Как пользоваться столом стабилизации?",
            "next": "about_table"
          },
          {
            "text": "Профессор Каландрия послала меня сюда для обучения",
            "next": "about_training",
            "condition": "quest_active_awakening_seeker_crystal_lab"
          },
          {
            "text": "До свидания",
            "next": "farewell"
          }
        ]
      },
      "about_lab": {
        "text": "Наша лаборатория — одна из самых современных в Академии! Здесь мы изучаем свойства различных осколков, разрабатываем методы их стабилизации и безопасного использования. У нас есть несколько специализированных зон: стабилизационная, аналитическая и экспериментальная. Хотя... в экспериментальную вас не пустят без особого разрешения.",
        "options": [
          {
            "text": "Вернуться к предыдущим вопросам",
            "next": "greeting"
          }
        ]
      },
      "about_research": {
        "text": "Сейчас мы работаем над несколькими проектами. Самый интересный — исследование резонансных свойств осколков разума. Оказывается, они могут усиливать друг друга при определённом расположении! Профессор Каландрия считает, что это может привести к созданию устойчивых коммуникационных сетей на больших расстояниях. Представляете, мгновенная связь между городами!",
        "options": [
          {
            "text": "Звучит впечатляюще",
            "next": "about_research_more"
          },
          {
            "text": "Вернуться к предыдущим вопросам",
            "next": "greeting"
          }
        ]
      },
      "about_research_more": {
        "text": "Да, это может изменить многое! Также мы исследуем способы нейтрализации негативных эффектов осколков искажения. Эти осколки крайне нестабильны и опасны, но их энергия невероятно мощная. Если бы нам удалось разработать надёжный метод их стабилизации... [он мечтательно смотрит вдаль] Магитех совершил бы огромный скачок вперёд.",
        "options": [
          {
            "text": "Вернуться к предыдущим вопросам",
            "next": "greeting"
          }
        ]
      },
      "about_table": {
        "text": "Стол стабилизации — это наша гордость! Серебряные контуры на нём формируют специальное резонансное поле, которое подавляет хаотичные колебания энергии в осколках. Для использования просто положите осколок на центральную плиту и активируйте контуры, прикоснувшись к кристаллу-активатору. Только не забудьте надеть защитные перчатки! В прошлом месяце один студент забыл и... [он показывает на обожжённую отметину на стене]",
        "options": [
          {
            "text": "Вернуться к предыдущим вопросам",
            "next": "greeting"
          }
        ]
      },
      "about_training": {
        "text": "Ах, вы тот самый новый Искатель! Профессор предупреждала о вашем приходе. Отлично, сейчас я подготовлю стол стабилизации для вашего обучения. Это базовый навык для любого, кто работает с осколками. Подойдите к столу, когда будете готовы. Я настрою его на учебный режим, чтобы вы могли безопасно практиковаться.",
        "options": [
          {
            "text": "Спасибо за помощь",
            "next": "training_instructions"
          }
        ]
      },
      "training_instructions": {
        "text": "Вот ваши первые инструкции: положите руки на кристальную плиту и сосредоточьтесь на своём дыхании. Почувствуйте, как энергия течёт от вас к столу и обратно. Стол поможет вам научиться стабилизировать осколки своей внутренней энергией. Это базовый навык Искателя. Когда закончите, поговорите со мной снова.",
        "options": [
          {
            "text": "Я приступаю к практике",
            "next": "greeting"
          }
        ]
      },
      "farewell": {
        "text": "До встречи! Будьте осторожны с осколками!",
        "options": []
      }
    },
    "trades": {
      "buy": [
        {
          "item_id": "safety_gloves",
          "price": 25,
          "stock": 5
        },
        {
          "item_id": "crystal_dust",
          "price": 10,
          "stock": 10
        },
        {
          "item_id": "crystal_vial",
          "price": 15,
          "stock": 3
        }
      ],
      "sell": [
        {
          "item_id": "crystal_dust",
          "price": 5
        },
        {
          "item_id": "crystal_fragment",
          "price": 12
        }
      ]
    }
  }
}
