{
  "professor_kalandria": {
    "name": "Профессор Каландрия",
    "title": "Глава кафедры кристальных исследований",
    "description": "Элегантная женщина средних лет с длинными серебристыми волосами, собранными в сложную причёску. Её синяя мантия украшена вышитыми кристаллами, а в руках она всегда держит хрустальный жезл, инкрустированный несколькими осколками различных типов. Глаза профессора светятся мягким голубым светом — признак длительного взаимодействия с кристальной магией.",
    "type": "quest",
    "dialogues": {
      "greeting": {
        "text": "Приветствую вас в Академии Кристальных Наук. Я профессор Каландрия, руководитель исследований осколков Великого Кристалла. Чем могу помочь?",
        "options": [
          {
            "text": "Расскажите об Академии",
            "next_id": "about_academy"
          },
          {
            "text": "Что вы изучаете?",
            "next_id": "about_research"
          },
          {
            "text": "Что известно о Великом Кристалле?",
            "next_id": "about_crystal"
          },
          {
            "text": "Кто такие Искатели?",
            "next_id": "about_seekers"
          },
          {
            "text": "Можно присоединиться к вашим исследованиям?",
            "next_id": "join_research",
            "condition": "quest_available_awakening_seeker"
          },
          {
            "text": "Я нашёл осколок, который вы искали.",
            "next_id": "found_shard",
            "condition": "quest_objective_awakening_seeker_collect_resonating_crystal_fragment"
          },
          {
            "text": "До свидания",
            "action": "exit"
          }
        ]
      },
      "about_academy": {
        "text": "Академия Кристальных Наук — главное научное учреждение Содружества Нового Рассвета. Основана 300 лет назад для изучения осколков Великого Кристалла и разработки безопасных методов их использования. Сейчас у нас учатся более 2000 студентов на пяти факультетах: Кристальной Магии, Практического Магитеха, Истории Раскола, Стабилизационных Техник и Исследования Артефактов.",
        "options": [
          {
            "text": "Интересно, расскажите больше",
            "next_id": "about_academy_more"
          },
          {
            "text": "Вернуться к предыдущим вопросам",
            "next_id": "greeting"
          }
        ]
      },
      "about_academy_more": {
        "text": "Академия также служит главным хранилищем знаний о технологиях Старого Эльдкрона. Наши архивы содержат тысячи манускриптов, спасённых из руин. Мы гордимся тем, что поддерживаем баланс между развитием технологий и безопасностью. В отличие от некоторых... технократов из Восточного района, которые считают, что прогресс важнее предосторожности.",
        "options": [
          {
            "text": "Вернуться к предыдущим вопросам",
            "next_id": "greeting"
          }
        ]
      },
      "about_research": {
        "text": "Моя кафедра специализируется на исследовании свойств различных типов осколков и их взаимодействия. Особенно нас интересуют осколки созидания и разума — самые редкие и сложные типы. Сейчас мы работаем над проектом по стабилизации осколков искажения, которые обычно слишком опасны для использования.",
        "options": [
          {
            "text": "Что такое осколки искажения?",
            "next_id": "about_distortion_shards"
          },
          {
            "text": "Вернуться к предыдущим вопросам",
            "next_id": "greeting"
          }
        ]
      },
      "about_distortion_shards": {
        "text": "Осколки искажения — самые непредсказуемые фрагменты Великого Кристалла. Они содержат энергию, которая буквально искривляет пространство и время вокруг себя. Неконтролируемое воздействие таких осколков привело к созданию многих аномальных зон в Диких Землях. Но если научиться стабилизировать их... потенциал применения просто огромен.",
        "options": [
          {
            "text": "Вернуться к предыдущим вопросам",
            "next_id": "greeting"
          }
        ]
      },
      "about_crystal": {
        "text": "Великий Кристалл был источником жизни и магии нашего мира. По размеру — высотой с гору. Он находился в центре древней столицы Эльдкрон и управлялся советом Семи Мудрецов. Наши исследования показывают, что Кристалл был не просто магическим артефактом, а, возможно, обладал определённым сознанием и целью.",
        "options": [
          {
            "text": "Что вызвало его разрушение?",
            "next_id": "about_shattering"
          },
          {
            "text": "Вернуться к предыдущим вопросам",
            "next_id": "greeting"
          }
        ]
      },
      "about_shattering": {
        "text": "Согласно историческим записям, группа магов 'Алый Консорциум' пыталась установить монопольный контроль над Кристаллом. Они провели ритуал, нарушивший стабильность Кристалла, что привело к катастрофе. Однако... [она понижает голос] некоторые наши исследования намекают, что Раскол мог быть не случайностью, а... преднамеренным действием самого Кристалла. Но это слишком спекулятивно для официальной науки.",
        "options": [
          {
            "text": "Вернуться к предыдущим вопросам",
            "next_id": "greeting"
          }
        ]
      },
      "about_seekers": {
        "text": "Искатели — особые люди с врождённой связью с осколками. Они могут чувствовать их присутствие, определять тип и потенциал, а также более эффективно извлекать их энергию. Такие способности очень редки — примерно один человек из тысячи. В Содружестве мы создали специальную программу для выявления и обучения Искателей. У вас, кстати, есть некоторые признаки этого дара.",
        "options": [
          {
            "text": "Вы думаете, я могу быть Искателем?",
            "next_id": "about_player_seeker"
          },
          {
            "text": "Вернуться к предыдущим вопросам",
            "next_id": "greeting"
          }
        ]
      },
      "about_player_seeker": {
        "text": "У вас определённо есть потенциал. Я вижу это по тому, как осколки в моём жезле реагируют на вашу близость. Если хотите проверить свои способности, я могла бы провести небольшой тест. В последнее время хороших Искателей найти так сложно, а у нас есть очень интересный проект...",
        "options": [
          {
            "text": "Я бы хотел пройти этот тест",
            "next_id": "join_research",
            "condition": "quest_available_awakening_seeker"
          },
          {
            "text": "Может быть позже",
            "next_id": "greeting"
          }
        ]
      },
      "join_research": {
        "text": "Отлично! Я как раз искала кого-то с потенциалом Искателя. Недавно мы обнаружили необычный осколок в руинах древнего Эльдкрона, но у нас возникли проблемы с его изучением. Возможно, свежий взгляд Искателя поможет. Я подготовила несколько упражнений, чтобы вы могли познакомиться со своими способностями.",
        "options": [
          {
            "text": "Я готов помочь",
            "next_id": "start_quest_awakening_seeker",
            "action": "start_quest_awakening_seeker"
          },
          {
            "text": "Мне нужно подумать",
            "next_id": "greeting"
          }
        ]
      },
      "start_quest_awakening_seeker": {
        "text": "Превосходно! Давайте начнём с базовых упражнений прямо здесь, в Академии. Сначала научимся чувствовать присутствие осколков. В этом помещении рассеяна кристальная пыль — мельчайшие частицы осколков. Попробуйте сосредоточиться и почувствовать их, а затем соберите несколько образцов для анализа.",
        "options": [
          {
            "text": "Я приступаю к поискам",
            "next_id": "greeting"
          }
        ]
      },
      "found_shard": {
        "text": "Вы нашли его! И судя по активности осколка, вы действительно обладаете даром Искателя! Этот резонирующий фрагмент настроен на определённую частоту, которую улавливают только истинные Искатели. Дайте мне изучить его... [она внимательно рассматривает осколок через кристальную линзу]",
        "options": [
          {
            "text": "Что показывает ваше исследование?",
            "next_id": "complete_quest_awakening_seeker",
            "action": "complete_quest_awakening_seeker"
          }
        ]
      },
      "complete_quest_awakening_seeker": {
        "text": "Это удивительно! Осколок, который вы нашли, сильно резонирует с вашей энергией. Как будто он... выбрал вас. Я думаю, это не случайность. Возможно, ваша судьба как Искателя только начинается. Возьмите этот малый осколок созидания и руководство по развитию кристального чутья. Они помогут вам на начальном этапе вашего пути.",
        "options": [
          {
            "text": "Что мне делать дальше?",
            "next_id": "next_steps"
          }
        ]
      },
      "next_steps": {
        "text": "Я рекомендую вам исследовать окрестности Нового Эльдкрона, набираться опыта и развивать свой дар. Когда почувствуете, что готовы к более серьёзным испытаниям, возвращайтесь. У меня есть несколько проектов, где пригодятся способности опытного Искателя. Особенно интересное исследование мы ведём в районе Аметистовой долины... но об этом позже.",
        "options": [
          {
            "text": "Спасибо за помощь, профессор",
            "next_id": "greeting"
          }
        ]
      },
      "farewell": {
        "text": "До встречи! Пусть осколки укажут вам путь.",
        "options": []
      }
    },
    "trades": {
      "buy": [
        {
          "item_id": "crystal_sensing_manual",
          "price": 50,
          "stock": 5,
          "condition": "player_level_3"
        },
        {
          "item_id": "minor_creation_shard",
          "price": 100,
          "stock": 2,
          "condition": "player_level_5"
        },
        {
          "item_id": "crystal_focus",
          "price": 150,
          "stock": 1,
          "condition": "quest_completed_awakening_seeker"
        },
        {
          "item_id": "resonance_gloves",
          "price": 300,
          "stock": 1,
          "condition": "player_level_10"
        }
      ],
      "sell": [
        {
          "item_id": "crystal_dust",
          "price": 5
        },
        {
          "item_id": "crystal_fragment",
          "price": 15
        },
        {
          "item_id": "minor_mind_shard",
          "price": 40
        },
        {
          "item_id": "minor_creation_shard",
          "price": 50
        }
      ]
    },
    "quests": ["awakening_seeker"]
  }
}
